importing libraries

In [1]:
import pandas as pd
import os

#importing the dataset

In [2]:
df=pd.read_csv("../Raw/data.csv")
df.head(10)

,UserID,CourseCategory,TimeSpentOnCourse,NumberOfVideosWatched,NumberOfQuizzesTaken,QuizScores,CompletionRate,DeviceType,CourseCompletion
0,5618,Health,29.979719,17,3,50.365656,20.860773,1,0
1,4326,Arts,27.802640,1,5,62.615970,65.632415,1,0
2,5849,Arts,86.820485,14,2,78.458962,63.812007,1,1
3,4992,Science,35.038427,17,10,59.198853,95.433162,0,1
4,3866,Programming,92.490647,16,0,98.428285,18.102478,0,0
5,8650,Health,79.466129,12,7,70.233329,76.484023,0,1
6,4321,Health,78.908724,10,2,86.836533,22.588896,1,0
7,4589,Business,12.068237,16,3,61.553646,27.410991,1,0
8,4215,Business,81.935709,8,4,90.264564,33.308437,0,1
9,8089,Programming,83.394026,15,10,63.956353,33.261300,1,0

checking the datatype of columns

In [3]:
print(df.dtypes)

UserID                     int64
CourseCategory            object
TimeSpentOnCourse        float64
NumberOfVideosWatched      int64
NumberOfQuizzesTaken       int64
QuizScores               float64
CompletionRate           float64
DeviceType                 int64
CourseCompletion           int64
dtype: object

check the rows and columns number in the dataset

In [4]:
print(f"number of rows = {df.shape[0]} and number of columns = {df.shape[1]}")

number of rows = 9000 and number of columns = 9

checking no of columns

In [5]:
df.columns

Index(['UserID', 'CourseCategory', 'TimeSpentOnCourse',
       'NumberOfVideosWatched', 'NumberOfQuizzesTaken', 'QuizScores',
       'CompletionRate', 'DeviceType', 'CourseCompletion'],
      dtype='object')

Remove user_id column

In [6]:
df = df.drop(columns=['UserID'])

check for missing values

In [7]:
def checking_m(df):
    null_v = df.isnull().sum().sort_values(ascending=False)
    null_percent = (df.isnull().sum()/df.isnull().count()).sort_values(ascending=False)
    null_v = pd.concat([null_v, null_percent], axis=1, keys=['Missing_count', 'Missing_%'])
    return null_v

checking_m(df)

                       Missing_count  Missing_%
CourseCategory                     0        0.0
TimeSpentOnCourse                  0        0.0
NumberOfVideosWatched              0        0.0
NumberOfQuizzesTaken               0        0.0
QuizScores                         0        0.0
CompletionRate                     0        0.0
DeviceType                         0        0.0
CourseCompletion                   0        0.0

check for dublicated rows

In [8]:
print("Numbers of duplicate rows :",df.duplicated().sum())

Numbers of duplicate rows : 877

Dropping duplicates and keeping the first occurrence of data

In [9]:
df = df.drop_duplicates(keep='first')

check for dublicated rows

In [10]:
print("Numbers of duplicate rows after removing duplicate :",df.duplicated().sum())

Numbers of duplicate rows after removing duplicate : 0

In [11]:
df.head()

,CourseCategory,TimeSpentOnCourse,NumberOfVideosWatched,NumberOfQuizzesTaken,QuizScores,CompletionRate,DeviceType,CourseCompletion
0,Health,29.979719,17,3,50.365656,20.860773,1,0
1,Arts,27.802640,1,5,62.615970,65.632415,1,0
2,Arts,86.820485,14,2,78.458962,63.812007,1,1
3,Science,35.038427,17,10,59.198853,95.433162,0,1
4,Programming,92.490647,16,0,98.428285,18.102478,0,0

In [12]:
cat_col =["CourseCategory","DeviceType","CourseCompletion"]

Check the unique class for each column

In [13]:
for column in df[cat_col]:
    print(f"{column}: {df[column].unique()}")

CourseCategory: ['Health' 'Arts' 'Science' 'Programming' 'Business']
DeviceType: [1 0]
CourseCompletion: [0 1]

In [14]:
file_path = os.path.join('../mart', 'final_data.csv')

df.to_csv(file_path, index=False)

print(f"CSV file saved in mart folder")

CSV file saved in mart folder